driver-tests/bpelse/nmproperty/AccessToSubject/BasicAuthEchoApp/src/jbiasa/BasicAuthEcho.xml

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="BasicAuthEcho" targetNamespace="http://j2ee.netbeans.org/wsdl/BasicAuthEcho/BasicAuthEcho"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/BasicAuthEcho/BasicAuthEcho" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:fi="http://java.sun.com/xml/ns/wsit/2006/09/policy/fastinfoset/service" xmlns:tcp="http://java.sun.com/xml/ns/wsit/2006/09/policy/soaptcp/service" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:sp="http://docs.oasis-open.org/ws-sx/ws-securitypolicy/200702" xmlns:sc="http://schemas.sun.com/2006/03/wss/server" xmlns:wspp="http://java.sun.com/xml/ns/wsit/policy" xmlns:sc1="http://schemas.sun.com/2006/03/wss/client">
    <types/>
    <message name="BasicAuthEchoOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="BasicAuthEchoOperationResponse">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="BasicAuthEchoPortType">
        <operation name="BasicAuthEchoOperation">
            <input name="input1" message="tns:BasicAuthEchoOperationRequest"/>
            <output name="output1" message="tns:BasicAuthEchoOperationResponse"/>
        </operation>
    </portType>
    <binding name="BasicAuthEchoBinding" type="tns:BasicAuthEchoPortType">
        <wsp:PolicyReference URI="#BasicAuthEchoBindingPolicy"/>
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="BasicAuthEchoOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/BasicAuthEcho/BasicAuthEcho"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/BasicAuthEcho/BasicAuthEcho"/>
            </output>
        </operation>
    </binding>
    <service name="BasicAuthEchoService">
        <port name="BasicAuthEchoPort" binding="tns:BasicAuthEchoBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/BasicAuthEchoService/BasicAuthEchoPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="BasicAuthEcho">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes.
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="BasicAuthEchoPortTypeRole" portType="tns:BasicAuthEchoPortType"/>
    </plnk:partnerLinkType>
    <wsp:Policy wsu:Id="BasicAuthEchoBindingPolicy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sc1:CallbackHandlerConfiguration wspp:visibility="private">
                    <sc1:CallbackHandler default="usr2" name="usernameHandler"/>
                    <sc1:CallbackHandler default="pass2" name="passwordHandler"/>
                </sc1:CallbackHandlerConfiguration>
                <sc1:TrustStore wspp:visibility="private" peeralias="xws-security-server" storepass="changeit" type="JKS" location="C:\GlassFishESBV2.1\glassfish\domains\domain1\config\cacerts.jks"/>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
</definitions>
