driver-tests/bpelse/nmproperty/AccessToSubject/SyncSampleWithSAML/SyncSampleWithSAML/src/newXMLDocument1.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:exc14n="http://www.w3.org/2001/10/xml-exc-c14n#">
    <S:Header>
        <wsse:Security S:mustUnderstand="1">
            <wsu:Timestamp xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://www.w3.org/2003/05/soap-envelope" wsu:Id="_3">
                <wsu:Created>2009-04-24T22:30:38Z</wsu:Created>
                <wsu:Expires>2009-04-24T22:35:38Z</wsu:Expires>
            </wsu:Timestamp>
            <xenc:EncryptedKey xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://www.w3.org/2003/05/soap-envelope" Id="_5002">
                <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" />
                <ds:KeyInfo xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="keyInfo">
                    <wsse:SecurityTokenReference>
                        <ds:X509Data>
                            <ds:X509IssuerSerial>
                                <ds:X509IssuerName>CN=SUNCA, OU=JWS, O=SUN, ST=Some-State, C=AU</ds:X509IssuerName>
                                <ds:X509SerialNumber>2</ds:X509SerialNumber>
                            </ds:X509IssuerSerial>
                        </ds:X509Data>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
                <xenc:CipherData>
                    <xenc:CipherValue>V5lgTL2/GJbdj4uRLiooePmxMydWKZ9OMQfoKMg9x05c0/VyvMbn8S8IbT35FQC/Cwf9LImVetgaIBh0GWUKIwOnAZ4Ob+HBx+sXvC0VIbqJ0XqEtWTNKsdEzmtvNnimGajiXJjEho5rfdzHjhhRv4zjDWAMNC1rq0nJ1OfxoWA=</xenc:CipherValue>
                </xenc:CipherData>
            </xenc:EncryptedKey>
            <xenc:ReferenceList xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://www.w3.org/2003/05/soap-envelope">
                <xenc:DataReference URI="#_5004" />
            </xenc:ReferenceList>
            <xenc:EncryptedData xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://www.w3.org/2003/05/soap-envelope" Type="http://www.w3.org/2001/04/xmlenc#Element" Id="_5004">
                <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" />
                <ds:KeyInfo xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="keyInfo">
                    <wsse:SecurityTokenReference>
                        <wsse:Reference ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" URI="#_5002" />
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
                <xenc:CipherData>
                    <xenc:CipherValue>GqZdMpYlblrskN8LTBKi+VovcchpgXP35MOsPPojzo7bQAHNfO2ruwmR1BpNCkFy5P1OorX+qNYyv/f2+DA0Kipm8boF2R8d0Aez2ieDmSXBSpWkDmjPW/NrmCacF84J7z4GBWW9D9sTK7eEZqF7BIRIu5F5KByRuAaKXxJLU+DJ1eGigZCxRTdpAytU98u1PbCRL8bWHNd+NNmhfNbyC/K0+tWHVgKx97WlprQaQX2shtJxDec6UhGZ191Se8huel7m/2WEgL1yMP1jElR1DxJpzPRj7me1TfJrjYFkNEfcGP2AIPVsbxMGKhEL4r0VfRjCzAOmDSyCLtikTenY3pOW5wMPGaDR3Wde3ZvShPo9xvTvwk0yfcN05D7OEbBWR/v0LBBZy4QysBq5ug0W4L0mUZR2BOAytqVfsWoqCHlRH+P+68xOky2+sX+B8qdhM9ygtvCAiwIoNmec9+SMbHa/gu1CxsU3E+U4vu2Z3oRUmrE9C4aNvO7/FBQiiM7e9qcz9RPd+A8jlHcljkeFpQJma4dgvVSXN5HJQNVC1cKqidamvdEX8cFQfNzYuvSe5V6Ncqqwy2Qdh17WXS4LNRgrPjHaP7F+Ll9BioN1biAd7F3AJWRoMYBFgLDlcBCZ</xenc:CipherValue>
                </xenc:CipherData>
            </xenc:EncryptedData>
            <ds:Signature xmlns:ns17="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512" xmlns:ns16="http://www.w3.org/2003/05/soap-envelope" Id="_1">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                        <exc14n:InclusiveNamespaces PrefixList="wsse S" />
                    </ds:CanonicalizationMethod>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1" />
                    <ds:Reference URI="#_5003">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <exc14n:InclusiveNamespaces PrefixList="S" />
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
                        <ds:DigestValue>NVcFcRb8mZ3pXuQOSZoerdaTEZE=</ds:DigestValue>
                    </ds:Reference>
                    <ds:Reference URI="#_3">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <exc14n:InclusiveNamespaces PrefixList="wsu wsse S" />
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
                        <ds:DigestValue>tAPjF1pfeIS9552QQ49MvkrVID8=</ds:DigestValue>
                    </ds:Reference>
                    <ds:Reference URI="#uuid_81116333-b847-4b33-9246-85e2e73aded4">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <exc14n:InclusiveNamespaces PrefixList="wsu wsse S" />
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
                        <ds:DigestValue>wFDOjsI4tHmAdcEJ0I91yQYEaOc=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>xgx7LQEui1tkBWfvfNdiozkA+Lg=</ds:SignatureValue>
                <ds:KeyInfo>
                    <wsse:SecurityTokenReference wsu:Id="uuid_897bc537-a28d-4571-b41c-768fdfbb6d76">
                        <wsse:Reference ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey" URI="#_5002" />
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </S:Header>
    <S:Body wsu:Id="_5003">
        <m:BasicAuthEchoOperation xmlns:m="http://j2ee.netbeans.org/wsdl/BasicAuthEcho/BasicAuthEcho">
            <part1 xmlns:cli="http://j2ee.netbeans.org/wsdl/BasicAuthEcho/clientBasicAuthEcho">test</part1>
        </m:BasicAuthEchoOperation>
    </S:Body>
</S:Envelope>